SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
/**
 * *****************************************************************************
 * @file    main.c
 * @brief   Standalone Camera + ToF Snapshot Capture — NUCLEO-N657X0-Q
 *
 *   Captures images from the CMW-IMX335 camera module and stores them as
 *   raw YUV422 frames on a microSD card.  Includes VL53L5CX Time-of-Flight
 *   sensor integration for distance measurements.
 *
 *   No USB/UVC, no FileX/fatfs, no PC connection required after flashing.
 *
 *   Hardware:
 *     - MCU:      STM32N657 (NUCLEO-N657X0-Q / MB1940)
 *     - Camera:   CMW-IMX335 (5 MP, YUV422 output via CSI-2)
 *     - ToF:      VL53L5CX (8x8 resolution, continuous mode)
 *     - Storage:  microSD card (SDMMC2, 4-bit bus)
 *     - Button:   USER B1 = PC13 (active HIGH, external pull-down)
 *     - LEDs:     RED = PG10, GREEN = PG0
 *     - Illumination: WS2812 (GPDMA1 + TIM1 PWM)
 *
 *   Flow (OPTIMIZED - Sleep Mode):
 *     1. Boot → init clocks, MPU, PSRAM, SD card
 *     2. Init camera + warmup frames (one-time cost at boot)
 *     3. STOP camera pipe (sleep = low power, fast wakeup)
 *     4. GREEN LED on (system ready)
 *     5. User presses USER button (PC13)
 *     6. START pipe → 3 frames → capture → STOP pipe (~100ms total)
 *     7. Frame saved to SD card
 *     8. Back to sleep → wait for next press
 *
 *   Two FreeRTOS tasks:
 *     - main_thread: board init, SD card init, camera sleep mode init,
 *                    then deletes itself
 *     - btn_thread:  polls USER button, triggers fast capture + SD write
 *
 *   All configurable parameters are in Inc/app_config.h.
 * *****************************************************************************
 */

/* ================================================================
   SECTION 1: INCLUDES
   ================================================================ */

#include <assert.h>
#include <stdio.h>
#include <string.h>

/* ---- STM32 HAL / BSP ---- */
#include "stm32n6xx_hal_conf.h"
#include "stm32n6xx_hal.h"
#include "stm32n6xx_hal_sd.h"
#include "stm32n6xx_hal_rif.h"
//#include "stm32n6xx_nucleo.h"
//#include "stm32n6xx_nucleo_bus.h"
//#include "stm32n6xx_nucleo_xspi.h"

#include "stm32n6570_discovery.h"
#include "stm32n6570_discovery_bus.h"
#include "stm32n6570_discovery_xspi.h"

/* ---- Illumination (WS2812) ---- */
#include "ws2812.h"

/* ---- Time of Flight (VL53L5CX) ---- */
#include "platform.h"
#include "vl53l5cx_api.h"
#include "vl53l5cx_plugin_motion_indicator.h"

/* ---- Application Modules ---- */
#include "app_config.h"
#include "app_cam.h"
#include "app_fuseprogramming.h"
#include "main.h"
#include "npu_cache.h"
#include "utils.h"

/* ---- FreeRTOS ---- */
#include "FreeRTOS.h"
#include "task.h"

#define BASELINE5CX_SAMPLES      10      /* Frames to learn baseline per zone */
#define INSECT5CX_THRESHOLD_PCT  10      /* Signal drop % to trigger detection */
#define NUM_ZONES             16      /* 4x4 resolution = 16 zones */
#define MOTION_INDICATOR_THRESH  20

//#define VL53L5CX_ZONES_ALL       0xFFFF
//#define VL53L5CX_ZONES_CENTER_4  0x1818

/* ================================================================
   SECTION 2: GLOBAL PERIPHERAL HANDLES
   ================================================================ */

/* I2C */
I2C_HandleTypeDef hi2c1;

/* UART (Debug Console) */
UART_HandleTypeDef huart1;

/* microSD (SDMMC2) */
SD_HandleTypeDef hsd1;

/* TIM1 (WS2812 PWM) */
TIM_HandleTypeDef htim1;

/* DMA (WS2812 Data) */
DMA_HandleTypeDef handle_GPDMA1_Channel1;

/* VL53L5CX ToF Sensor State */
VL53L5CX_Configuration  Dev;
VL53L5CX_ResultsData    Results;
uint8_t                 status;
uint8_t                 isAlive;
uint8_t                 isReady;

static uint32_t  g_baseline_signal[NUM_ZONES] = {0};
static uint16_t  g_baseline_distance[NUM_ZONES] = {0};
static uint8_t   g_zone_valid[NUM_ZONES] = {0};
static uint8_t   g_baseline_ready = 0;

//static uint16_t g_zone_mask      = VL53L5CX_ZONES_CENTER_4;
//static uint8_t  g_zone_filter_on = 1;
//
//static inline int is_zone_enabled(uint8_t z)
//{
//    if (!g_zone_filter_on) return 1;
//    return (g_zone_mask >> z) & 1;
//}

/* ================================================================
   SECTION 3: FREERTOS TASK CONTROL BLOCKS AND STACKS
   ================================================================ */

static StaticTask_t    main_thread_cb;
static StackType_t     main_thread_stack[configMINIMAL_STACK_SIZE];

static StaticTask_t    btn_thread_cb;
static StackType_t     btn_thread_stack[4 * configMINIMAL_STACK_SIZE];

/** Insect detection task (runs forever, monitors ToF sensor) */
static StaticTask_t    insect_thread_cb;
static StackType_t     insect_thread_stack[4 * configMINIMAL_STACK_SIZE];

/* ================================================================
   SECTION 4: FORWARD DECLARATIONS
   ================================================================ */

/* ---- System Configuration ---- */
static void SystemClock_Config(void);
static void Security_Config(void);
static void IAC_Config(void);
static void CONSOLE_Config(void);
static void Setup_Mpu(void);

/* ---- FreeRTOS Entry Points ---- */
static int   main_freertos(void);
static void  main_thread_fct(void *arg);
static void  btn_thread_fct(void *arg);
static void  insect_detection_task(void *arg);

/* ---- SD Card Operations ---- */
static void  SD_Benchmarks(void);
static int   SD_StoreRawImage(const uint8_t *img_buf, uint32_t img_size,
                              uint32_t w, uint32_t h, uint32_t pixel_format);
static int   SD_ReadRawImage(uint8_t *img_buf, uint32_t *data_size_p);

/* ---- Peripheral Initialization (WS2812 / Illumination) ---- */
static void MX_TIM1_Init(void);
static void MX_GPDMA1_Init(void);
void        PeriphCommonClock_Config(void);

/* ---- Peripheral Initialization (VL53L5CX ToF Sensor) ---- */
static void VL53L5CX_I2C_Init(void);
static void VL53L5CX_GPIO_Init(void);
static void VL53L5CX_StartSequence(void);
static void VL53L5CX_Validate(void);
static void VL53L5CX_ReadingTest(void);
static void VL53L5CX_MotionTest(void);

/* ---- External References ---- */
extern void  vPortSetupTimerInterrupt(void);
extern int   __uncached_bss_start__;
extern int   __uncached_bss_end__;


/* ================================================================
   SECTION 5: RUNTIME STATE AND BUFFERS
   ================================================================ */

