SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    /* --- Step 2: Write remaining image data in full batches --- */
    while (img_offset < img_size) {
        uint32_t remaining_bytes = img_size - img_offset;
        uint32_t remaining_blocks_full = (remaining_bytes + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
        uint32_t blocks_in_batch = (remaining_blocks_full < SD_BATCH_WRITE_BLOCKS)
                                    ? remaining_blocks_full : SD_BATCH_WRITE_BLOCKS;

        /* Fill the batch buffer */
        for (uint32_t b = 0; b < blocks_in_batch; b++) {
            uint32_t src = img_offset + b * SD_BLOCK_SIZE;
            uint32_t dst = b * SD_BLOCK_SIZE;
            if (src + SD_BLOCK_SIZE <= img_size) {
                /* Full block — direct copy */
                memcpy(sd_batch_buf + dst, img_buf + src, SD_BLOCK_SIZE);
            } else {
                /* Last block — copy partial + zero-pad */
                uint32_t partial = img_size - src;
                memcpy(sd_batch_buf + dst, img_buf + src, partial);
                memset(sd_batch_buf + dst + partial, 0, SD_BLOCK_SIZE - partial);
            }
        }

        /* Wait for SD card to be ready before next batch.
           SDXC cards (128GB+) need significant time between multi-block write
           operations to complete internal flash programming. A tight loop is
           insufficient — we use TaskYIELD to let the SDMMC interrupt handler
           process and update the card state machine. */
        {
            uint32_t wait_ms = 0;
            while (HAL_SD_GetCardState(&hsd1) != HAL_SD_CARD_TRANSFER && wait_ms < 2000) {
                vTaskDelay(pdMS_TO_TICKS(1));
                wait_ms++;
            }
            if (wait_ms >= 2000) {
                printf("[SD Store] Card timeout before block %lu (state=%lu after %lu ms)\n",
                       (unsigned long)current_block,
                       (unsigned long)HAL_SD_GetCardState(&hsd1),
                       (unsigned long)wait_ms);
            }
        }

        st = HAL_SD_WriteBlocks(&hsd1, sd_batch_buf, current_block, blocks_in_batch, HAL_MAX_DELAY);
        if (st != HAL_OK) {
            printf("[SD Store] batch FAIL at block %lu (HAL=0x%08lX STA=0x%08lX)\n",
                   (unsigned long)current_block, (unsigned long)st, (unsigned long)SDMMC2->STA);
            return -1;
        }

        img_offset += blocks_in_batch * SD_BLOCK_SIZE;
        current_block += blocks_in_batch;
    }

    printf("[SD Store] OK (blocks %lu..%lu, %lu HAL calls vs %lu original)\n",
           (unsigned long)base, (unsigned long)(current_block - 1),
           (unsigned long)((total_blocks + SD_BATCH_WRITE_BLOCKS - 1) / SD_BATCH_WRITE_BLOCKS),
           (unsigned long)total_blocks);
    return 0;
}


/* ================================================================
   SECTION 14: BUTTON THREAD (runs forever)
   ================================================================ */

/**
 * @brief  Button polling task (highest priority)
 *
 *         Waits for the system_ready flag, then enters a loop polling
 *         the USER button (PC13). On press: activates WS2812 illumination,
 *         captures a single camera frame, and saves it to SD card.
 */
static void btn_thread_fct(void *arg)
{
    (void)arg;

    /* Wait until main_thread completes initialization */
    while (!system_ready) vTaskDelay(pdMS_TO_TICKS(500));

    /* ---- Initialize VL53L5CX ToF Sensor ---- */
    //VL53L5CX_Validate();
    //VL53L5CX_ReadingTest();
    //VL53L5CX_MotionTest();

    printf("\n============================================\n");
    printf("  STANDALONE SNAPSHOT MODE\n");
    printf("  Resolution: %d x %d @ %d FPS\n",
           SNAP_WIDTH, SNAP_HEIGHT, SNAP_FPS);
    printf("  Camera: ON-DEMAND (init per capture)\n");
    printf("  Press USER button (PC13) to capture.\n");
    printf("============================================\n\n");

    BSP_LED_On(LED_GREEN);

    while (1) {
        if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET) {
            vTaskDelay(pdMS_TO_TICKS(BTN_DEBOUNCE_MS));
            if (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) != GPIO_PIN_SET)
                continue;

            /* Activate illumination and status LEDs */
            WS2812_TurnOn();
            BSP_LED_Off(LED_GREEN);
            BSP_LED_On(LED_RED);

            uint32_t t_capture_start = HAL_GetTick();
            uint32_t snap_num = snap_count + 1;
            printf("[BTN] >>> Button pressed! Capturing #%lu...\n", (unsigned long)snap_num);

            /* Full init + capture + deinit (safe - CMW doesn't support pipe restart) */
            int rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE,
                                            SNAP_WIDTH, SNAP_HEIGHT,
                                            SNAP_FPS, SNAP_WARMUP_FRAMES);

            uint32_t t_capture_end = HAL_GetTick();
            uint32_t capture_elapsed = t_capture_end - t_capture_start;

            if (rc != 0) {
                printf("[BTN] >>> Camera capture FAILED (rc=%d)!\n", rc);
                BSP_LED_Off(LED_RED);
                BSP_LED_On(LED_GREEN);
                while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET)
                    vTaskDelay(pdMS_TO_TICKS(50));
                continue;
            }

            /* Calculate SD block offsets for this snapshot */
            uint32_t frame_size   = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;
            uint32_t total_blocks = (SD_IMG_HEADER_SIZE + frame_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
            uint32_t target_block = snap_base_block + (snap_count * total_blocks);
            uint32_t saved_base   = SD_IMG_BASE_BLOCK;
            SD_IMG_BASE_BLOCK     = target_block;

            printf("[CAM] Captured in %lu ms!\n", (unsigned long)capture_elapsed);

            uint32_t t_sd_start = HAL_GetTick();

            if (SD_StoreRawImage(capture_buf, frame_size, SNAP_WIDTH, SNAP_HEIGHT, 0) == 0) {
                snap_count++;
                uint32_t t_sd_end = HAL_GetTick();
                printf("[BTN] >>> Snapshot #%lu SAVED (block %lu)\n",
                       (unsigned long)snap_num, (unsigned long)target_block);
                printf("[PERF] Capture=%lums + SD=%lums = Total=%lums\n",
                       (unsigned long)capture_elapsed,
                       (unsigned long)(t_sd_end - t_sd_start),
                       (unsigned long)(t_sd_end - t_capture_start));
            } else {
                printf("[BTN] >>> SD write FAILED!\n");
            }

            /* Deactivate illumination and restore status LEDs */
            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);
            WS2812_TurnOff();

            /* Wait for button release */
            while (HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_13) == GPIO_PIN_SET)
                vTaskDelay(pdMS_TO_TICKS(50));
        }

        vTaskDelay(pdMS_TO_TICKS(BTN_POLL_DELAY_MS));
    }
}

static void insect_detection_task(void *arg)
{
    (void)arg;

    uint8_t status_local;
    uint8_t isAlive;
    uint8_t is_ready;
    uint8_t i;

    /* ---- Wait for system to be ready ---- */
    while (!system_ready) {
        vTaskDelay(pdMS_TO_TICKS(500));
    }

    printf("\n============================================\n");
    printf("  INSECT DETECTION MODE (VL53L5CX)\n");
    printf("  4x4 zone-based signal drop detection\n");
    printf("============================================\n\n");

    /* ---- Properly initialize the sensor FIRST ---- */
    printf("[ToF] Initializing VL53L5CX...\n");

    /* Power up the sensor */
    VL53L5CX_GPIO_Init();
    VL53L5CX_StartSequence();

    Dev.platform.address = 0x29;

    /* Check if sensor is alive */
    status_local = vl53l5cx_is_alive(&Dev, &isAlive);
    if (!isAlive || status_local) {
        printf("[ERROR] VL53L5CX sensor not detected!\n");
        printf("  Status: %d, Alive: %d\n", status_local, isAlive);
        while (1) {
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    printf("[ToF] Sensor detected!\n");

