SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    /* Initialize the sensor */
    status_local = vl53l5cx_init(&Dev);
    if (status_local) {
        printf("[ERROR] VL53L5CX init failed: %d\n", status_local);
        while (1) {
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    printf("[ToF] Sensor initialized\n");

    /* ---- High-Performance Configuration (same as VL53L5CX_ReadingTest) ---- */
    status_local = vl53l5cx_set_resolution(&Dev, VL53L5CX_RESOLUTION_4X4);

    /* Reset baseline state */
    memset(g_baseline_signal, 0, sizeof(g_baseline_signal));
    memset(g_baseline_distance, 0, sizeof(g_baseline_distance));
    memset(g_zone_valid, 0, sizeof(g_zone_valid));
    g_baseline_ready = 0;

    /* Integration time: 800 ms */
    status_local = vl53l5cx_set_integration_time_ms(&Dev, 800);

    /* Ranging frequency: 15 Hz (maximum for 4x4 resolution) */
    status_local = vl53l5cx_set_ranging_frequency_hz(&Dev, 15);

    /* Always report the closest object */
    status_local = vl53l5cx_set_target_order(&Dev, VL53L5CX_TARGET_ORDER_CLOSEST);

    /* Sharpener at 10% to reduce pixel blurring */
    status_local = vl53l5cx_set_sharpener_percent(&Dev, 10);

    /* Continuous ranging mode */
    status_local = vl53l5cx_set_ranging_mode(&Dev, VL53L5CX_RANGING_MODE_CONTINUOUS);

    /* ---- Start Ranging ---- */
    vl53l5cx_start_ranging(&Dev);
    VL53L5CX_WaitMs(&(Dev.platform), 200);
    printf("[ToF] Ranging started...\n");

    /* ================================================================ */
    /*  Phase 1: Learn per-zone baseline signal (same as ReadingTest)   */
    /* ================================================================ */
    printf("\r\n[BASELINE] Taking %d samples per zone...\r\n", BASELINE5CX_SAMPLES);

    for (i = 0; i < BASELINE5CX_SAMPLES; i++)
    {
        /* Wait for data ready */
        do {
            vl53l5cx_check_data_ready(&Dev, &is_ready);
            if (!is_ready) vTaskDelay(pdMS_TO_TICKS(10));
        } while (!is_ready);

        /* Get results (includes implicit interrupt clear) */
        if (vl53l5cx_get_ranging_data(&Dev, &Results) != 0)
            continue;

        /* Accumulate per-zone signal and distance */
        for (int z = 0; z < NUM_ZONES; z++)
        {
            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

            if (Results.target_status[idx] == 0 || Results.target_status[idx] == 5 || Results.target_status[idx] == 9)
            {
                g_baseline_signal[z] += Results.signal_per_spad[idx];
                g_baseline_distance[z] += Results.distance_mm[idx];
                g_zone_valid[z] = 1;
            }
        }

        /* Progress indicator */
        printf("  [%d/%d]\r", i + 1, BASELINE5CX_SAMPLES);
    }

    /* Compute per-zone averages */
    printf("\r\n[BASELINE] Zone | Distance(mm) | Signal(kcps/spad)\r\n");
    printf("----------|----------------|----------------------\r\n");

    uint8_t valid_zone_count = 0;

    for (int z = 0; z < NUM_ZONES; z++)
    {
        if (g_zone_valid[z])
        {
            g_baseline_signal[z] /= BASELINE5CX_SAMPLES;
            g_baseline_distance[z] /= BASELINE5CX_SAMPLES;
            valid_zone_count++;

            printf("  Z%2d    |    %8d     |    %10d\r\n",
                   z, g_baseline_distance[z], g_baseline_signal[z]);
        }
    }

    printf("\r\n[BASELINE] Valid zones: %d/%d\r\n", valid_zone_count, NUM_ZONES);
    printf("[BASELINE] Insect threshold: >%d%% drop in any zone\r\n",
           INSECT5CX_THRESHOLD_PCT);

    if (valid_zone_count < 2) {
        printf("[ERROR] Not enough valid zones for baseline (%d/%d)\n", valid_zone_count, NUM_ZONES);
        printf("  Please check sensor connection and ensure objects are in range.\n");
        while (1) {
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }

    g_baseline_ready = 1;

    /* ================================================================ */
    /*  Phase 2: Monitor per-zone for insect detection (same as ReadingTest) */
    /* ================================================================ */
    printf("\r\n[MONITORING] Watching %d zones for insect passage...\r\n",
           valid_zone_count);
    printf("  Camera will auto-capture on insect detection.\r\n\r\n");

    uint32_t capture_count = 0;
    uint32_t cooldown_frames = 0;
    const uint32_t COOLDOWN_FRAMES_VALUE = 30;

    while (1)
    {
        /* Wait for data ready */
        do {
            vl53l5cx_check_data_ready(&Dev, &is_ready);
            if (!is_ready) vTaskDelay(pdMS_TO_TICKS(10));
        } while (!is_ready);

        /* Get results */
        if (vl53l5cx_get_ranging_data(&Dev, &Results) != 0)
            continue;

        /* ---- Check each zone independently against its own baseline ---- */
        uint8_t  insect_found = 0;
        uint8_t  affected_zones[NUM_ZONES] = {0};
        uint32_t affected_drop[NUM_ZONES] = {0};
        uint8_t  affected_count = 0;

        for (int z = 0; z < NUM_ZONES; z++)
        {
            if (!g_zone_valid[z])
                continue;  /* Skip zones with no baseline */

            uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;

            if (Results.target_status[idx] != 0 && Results.target_status[idx] != 5 && Results.target_status[idx] != 9)
                continue;  /* Skip invalid measurements this frame */

            /* Compute signal drop for this zone vs its own baseline */
            uint32_t signal_drop = 0;
            if (g_baseline_signal[z] > 0)
            {
                int32_t diff = (int32_t)g_baseline_signal[z] -
                               (int32_t)Results.signal_per_spad[idx];
                if (diff < 0) diff = -diff;
                signal_drop = (uint32_t)diff * 100 / g_baseline_signal[z];
            }

            if (signal_drop > INSECT5CX_THRESHOLD_PCT)
            {
                affected_zones[affected_count] = z;
                affected_drop[affected_count] = signal_drop;
                affected_count++;
                insect_found = 1;
            }
        }

        /* ---- Check cooldown ---- */
        if (cooldown_frames > 0) {
            cooldown_frames--;
        }

