SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
        /* ---- Report results + Trigger camera on detection ---- */
        if (insect_found && cooldown_frames == 0)
        {
            /* Build zone list string */
            char zone_list[64] = {0};
            for (uint8_t k = 0; k < affected_count; k++)
            {
                char tmp[16];
                sprintf(tmp, "Z%u", affected_zones[k]);
                if (k == 0)
                    strcpy(zone_list, tmp);
                else
                    strcat(zone_list, tmp);
            }

            printf(">>> INSECT DETECTED! Zones: [%s] (%u zone(s))\r\n",
                   zone_list, affected_count);

            /* Print details for each affected zone */
            for (uint8_t k = 0; k < affected_count; k++)
            {
                uint8_t z = affected_zones[k];
                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
                printf("    Z%2d: dist=%4dmm  signal=%6d  baseline=%6d  (drop=%u%%)\r\n",
                       z,
                       Results.distance_mm[idx],
                       Results.signal_per_spad[idx],
                       g_baseline_signal[z],
                       affected_drop[k]);
            }
            printf("\r\n");

            /* ---- TRIGGER CAMERA CAPTURE ---- */
            printf("    Triggering camera capture...\n");

            BSP_LED_Off(LED_GREEN);
            BSP_LED_On(LED_RED);

            /* Flash WS2812 */
            WS2812_TurnOn();
            HAL_Delay(100);
            WS2812_TurnOff();

            /* Capture image */
            uint32_t snap_num = capture_count + 1;
            int rc = CAM_CaptureSingleFrame(capture_buf, MAX_SNAP_FRAME_SIZE,
                                            SNAP_WIDTH, SNAP_HEIGHT,
                                            SNAP_FPS, SNAP_WARMUP_FRAMES);

            if (rc == 0) {
                uint32_t frame_size = (uint32_t)SNAP_WIDTH * SNAP_HEIGHT * 2UL;
                uint32_t total_blocks = (SD_IMG_HEADER_SIZE + frame_size + SD_BLOCK_SIZE - 1) / SD_BLOCK_SIZE;
                uint32_t target_block = snap_base_block + (capture_count * total_blocks);

                uint32_t saved_base = SD_IMG_BASE_BLOCK;
                SD_IMG_BASE_BLOCK = target_block;

                if (SD_StoreRawImage(capture_buf, frame_size, SNAP_WIDTH, SNAP_HEIGHT, 0) == 0) {
                    capture_count++;
                    printf("    >>> Snapshot #%lu SAVED!\n", (unsigned long)snap_num);
                } else {
                    printf("    [ERROR] SD write failed!\n");
                }

                SD_IMG_BASE_BLOCK = saved_base;
            } else {
                printf("    [ERROR] Camera capture failed (rc=%d)!\n", rc);
            }

            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);

            /* Apply cooldown to prevent rapid-fire captures */
            cooldown_frames = COOLDOWN_FRAMES_VALUE;
            printf("    Cooldown: %d frames (%.1f seconds)\n\n",
                   COOLDOWN_FRAMES_VALUE, (float)COOLDOWN_FRAMES_VALUE / 15.0f);

        }
        else
        {
            /* Compact status: show min/max distance and signal across valid zones */
            uint16_t min_d = 9999, max_d = 0;
            uint32_t min_s = 999999, max_s = 0;
            uint8_t  frame_valid = 0;

            for (int z = 0; z < NUM_ZONES; z++)
            {
                if (!g_zone_valid[z]) continue;
                uint8_t idx = VL53L5CX_NB_TARGET_PER_ZONE * z;
                if (Results.target_status[idx] != 0 && Results.target_status[idx] != 5 && Results.target_status[idx] != 9) continue;

                frame_valid++;
                if (Results.distance_mm[idx] < min_d) min_d = Results.distance_mm[idx];
                if (Results.distance_mm[idx] > max_d) max_d = Results.distance_mm[idx];
                if (Results.signal_per_spad[idx] < min_s) min_s = Results.signal_per_spad[idx];
                if (Results.signal_per_spad[idx] > max_s) max_s = Results.signal_per_spad[idx];
            }

            if (frame_valid > 0 && (capture_count == 0 || (g_baseline_distance[0] > 0 && min_d < g_baseline_distance[0])))
            {
                printf(". zones=%2d  dist=%4d-%4dmm  signal=%5d-%5d  (captures: %lu)\r\n",
                       frame_valid, min_d, max_d, min_s, max_s,
                       (unsigned long)capture_count);
            }
        }
    }
}

/* ================================================================
   SECTION 15: FREERTOS INITIALIZATION
   ================================================================ */

/**
 * @brief  Create and start FreeRTOS tasks
 *
 *         Creates two static tasks:
 *         - main_thread (priority 2): Board initialization, then deletes itself
 *         - btn_thread  (priority 3): Button polling and capture loop
 */
static int main_freertos(void)
{
    TaskHandle_t hdl;

    hdl = xTaskCreateStatic(main_thread_fct, "main",
                            configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 1,
                            main_thread_stack, &main_thread_cb);
    assert(hdl != NULL);

    /* Create insect detection task (priority: IDLE+2 - higher than button) */
    hdl = xTaskCreateStatic(insect_detection_task, "insect",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            insect_thread_stack, &insect_thread_cb);
    assert(hdl != NULL);

    /* Button task at HIGHER priority for immediate response */
    hdl = xTaskCreateStatic(btn_thread_fct, "btn",
                            4 * configMINIMAL_STACK_SIZE, NULL,
                            tskIDLE_PRIORITY + 2,
                            btn_thread_stack, &btn_thread_cb);
    assert(hdl != NULL);

    vTaskStartScheduler();
    assert(0);
    return -1;
}


/* ================================================================
   SECTION 16: MAIN THREAD (runs once: board init, then deletes)
   ================================================================ */

/**
 * @brief  Main initialization task
 *
 *         Performs all hardware initialization in sequence:
 *         1. NVIC priorities
 *         2. System clock
 *         3. Debug console
 *         4. Fuse programming
 *         5. WS2812 illumination (DMA + TIM)
 *         6. VL53L5CX ToF sensor (I2C + GPIO)
 *         7. PSRAM (XSPI RAM + NOR)
 *         8. LEDs + User button
 *         9. Security + IAC config
 *         10. Low-power clock gates
 *         11. SD card init + benchmark
 *         12. Set system_ready flag, delete task
 */
static void main_thread_fct(void *arg)
{
    (void)arg;
    uint32_t preemptPriority, subPriority;
    IRQn_Type i;
    int ret;

    /* ---- NVIC Priority Configuration ---- */
    HAL_NVIC_GetPriority(SysTick_IRQn, HAL_NVIC_GetPriorityGrouping(),
                         &preemptPriority, &subPriority);
    for (i = PVD_PVM_IRQn; i <= LTDC_UP_ERR_IRQn; i++)
        HAL_NVIC_SetPriority(i, preemptPriority, subPriority);

    /* ---- Clocks + Console + Fuses ---- */
    SystemClock_Config();
    vPortSetupTimerInterrupt();
    CONSOLE_Config();
    Fuse_Programming();

