SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/main.c
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 0;
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    HAL_TIM_PWM_ConfigChannel(&htim1, &sConfigOC, TIM_CHANNEL_1);

    sBreakDeadTimeConfig.OffStateRunMode = TIM_OSSR_DISABLE;
    sBreakDeadTimeConfig.OffStateIDLEMode = TIM_OSSI_DISABLE;
    sBreakDeadTimeConfig.LockLevel = TIM_LOCKLEVEL_OFF;
    sBreakDeadTimeConfig.DeadTime = 0;
    sBreakDeadTimeConfig.BreakState = TIM_BREAK_DISABLE;
    sBreakDeadTimeConfig.AutomaticOutput = TIM_AUTOMATICOUTPUT_DISABLE;
    HAL_TIMEx_ConfigBreakDeadTime(&htim1, &sBreakDeadTimeConfig);

    HAL_TIM_MspPostInit(&htim1);
}

/**
 * @brief  Configure peripheral common clock (TIM prescaler)
 */
void PeriphCommonClock_Config(void)
{
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {0};
    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_TIM;
    PeriphClkInitStruct.TIMPresSelection = RCC_TIMPRES_DIV1;
    if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct) != HAL_OK) {
        //Error_Handler();
    }
}

/**
 * @brief  GPDMA1 initialization for WS2812 data transmission
 *
 *         Enables GPDMA1 clock and configures Channel1 IRQ.
 */
static void MX_GPDMA1_Init(void)
{
    __HAL_RCC_GPDMA1_CLK_ENABLE();
    HAL_NVIC_SetPriority(GPDMA1_Channel1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(GPDMA1_Channel1_IRQn);
}


/* ================================================================
   SECTION 20: I2C1 INITIALIZATION (VL53L5CX ToF Sensor)
   ================================================================ */

/**
 * @brief  I2C1 initialization for VL53L5CX Time-of-Flight sensor
 *
 *         Timing: 0x00401242 (100 kHz standard mode)
 *         Addressing: 7-bit
 *         Analog filter: enabled
 *         Fast mode plus: enabled
 */
static void VL53L5CX_I2C_Init(void)
{
    hi2c1.Instance = I2C1;
    hi2c1.Init.Timing = 0x00401242;
    hi2c1.Init.OwnAddress1 = 0;
    hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
    hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    hi2c1.Init.OwnAddress2 = 0;
    hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
    hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

    if (HAL_I2C_Init(&hi2c1) != HAL_OK) {
        //Error_Handler();
    }

    /* Configure Analog filter */
    if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK) {
        //Error_Handler();
    }

    /* Configure Digital filter */
    if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK) {
        //Error_Handler();
    }

    /* I2C Fast mode Plus enable */
    if (HAL_I2CEx_ConfigFastModePlus(&hi2c1, I2C_FASTMODEPLUS_ENABLE) != HAL_OK) {
        //Error_Handler();
    }
}


/* ================================================================
   SECTION 21: VL53L5CX TIME-OF-FLIGHT SENSOR FUNCTIONS
   ================================================================ */

/**
 * @brief  Initialize GPIO pins for VL53L5CX control signals
 *
 *         Pin Mapping:
 *           - PD0  → PWR_EN  (Power Enable, active HIGH)
 *           - PE7  → I2C_RST (Reset, active LOW pulse)
 *           - PD6  → LPn     (Low Power disable, active HIGH)
 */
static void VL53L5CX_GPIO_Init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* PWR_EN (PD0) - Power Enable output */
    GPIO_InitStruct.Pin = GPIO_PIN_0;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

    /* I2C_RST (PE7) - Reset output */
    GPIO_InitStruct.Pin = GPIO_PIN_7;
    HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

    /* LPn (PD6) - Low Power mode disable output */
    GPIO_InitStruct.Pin = GPIO_PIN_6;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
}

/**
 * @brief  Execute VL53L5CX power-up sequence
 *
 *         Sequence:
 *           1. Assert PWR_EN (PD0 HIGH)
 *           2. Pulse reset (PE7 LOW → HIGH)
 *           3. Disable low-power mode (PD6 HIGH)
 *           4. Wait for sensor stabilization
 */
static void VL53L5CX_StartSequence(void)
{
    printf("\n=== ToF Sensor Power Up ===\n");

    /* Step 1: Enable power (PWR_EN = HIGH) */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_0, GPIO_PIN_SET);
    HAL_Delay(10);  /* Power stabilization delay */

    /* Step 2: Reset pulse (active LOW) */
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7, GPIO_PIN_RESET);
    HAL_Delay(10);
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7, GPIO_PIN_SET);
    HAL_Delay(10);

    /* Step 3: Disable Low Power mode (LPn = HIGH) */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_SET);
    HAL_Delay(100);

    printf("[OK] Sensor power-up complete\n\n");
}

/**
 * @brief  Validate VL53L5CX sensor presence and initialize
 *
 *         Checks if the sensor is alive at I2C address 0x29,
 *         initializes the device, and scans the I2C bus for
 *         all connected devices.
 */
static void VL53L5CX_Validate(void)
{
    Dev.platform.address = 0x29;

    /* Check if sensor is alive */
    status = vl53l5cx_is_alive(&Dev, &isAlive);
    printf("ALIVE %i and status %i\r\n", isAlive, status);

    if (!isAlive || status) {
        printf("Sensor NOT detected\r\n");
    } else {
        printf("Sensor detected\r\n");

        status = vl53l5cx_init(&Dev);
        if (status) {
            printf("Init FAIL\r\n");
        } else {
            printf("Init OK\r\n");
            vl53l5cx_start_ranging(&Dev);
        }
    }
    HAL_Delay(1000);

    /* Scan I2C bus for all connected devices */
    for (uint8_t addr = 0; addr < 128; addr++) {
        if (HAL_I2C_IsDeviceReady(&hi2c1, addr << 1, 1, 10) == HAL_OK) {
            printf("I2C device found at 0x%02X\r\n", addr);
        }
    }
}

/**
 * @brief  Configure VL53L5CX for high-performance continuous ranging
 *
 *         Settings:
 *           - Resolution:    8x8 (64 zones)
 *           - Integration:   800 ms
 *           - Frequency:     15 Hz
 *           - Target order:  Closest object
 *           - Sharpener:     10%
 *           - Mode:          Continuous
 *
 *         After configuration, reads 6 sample frames and prints
 *         distance + target status for all 64 zones.
 */
static void VL53L5CX_ReadingTest(void)
{

